<div class="story" style="text-align: center">
    <img src="{{MEDIA}}iceberg-storms.png" width="600px" alt="storms"/>
</div>

<p>
  Un extra&ntilde;o conjunto acontecimientos ha hecho que seas el capit&aacute;n de un buque que
  tiene como misi&oacute;n, entregar un cargamento a trav&eacute;s de un tramo de mar muy peligroso;
  sembrado de rocas heladas, icebergs y tornados errantes. Deber&aacute;s entregar dicho
  cargamento lo m&aacute;s r&aacute;pido posible para ahorrar en combustible.
</p>

<p>
  Se te dar&aacute; un mapa de un mar helado en forma de cuadr&iacute;cula, y la cantidad de combustible.
  Comienzas tu traves&iacute;a en la esquina noroeste y deber&aacute;s entregar el cargamento en el
  puerto ubicado en la esquina sur-oriente. El mar est&aacute; lleno de rocas y tornados
  magn&eacute;ticos errantes. Estos tornados son peque&ntilde;os, pero peligrosos y normalmente
  vagan de forma aleatoria en el mar. Sin embargo, cuando tu barco se acerca,
  comienzan una "persecuci&oacute;n" a tu barco debido a sus inusuales propiedades magn&eacute;ticas.
  Los tornados siempre toman el camino m&aacute;s corto, pero no pueden pasar a trav&eacute;s de
  las rocas.  Deber&aacute;s evitar a toda costa navegar hacia un tornado, golpear un
  iceberg o dejar el mapa, de lo contrario invocaras una maldici&oacute;n h&uacute;meda para ti y
  tu tripulaci&oacute;n.
</p>

<p>
  El mapa se representa como una secuencia de cadenas (<em>str</em>) donde "S" es el barco "."
  es una celda vac&iacute;a, "X" es un iceberg y "O" es un tornado. Por cada paso deber&aacute;s
  devolver una acci&oacute;n, como una cadena con un car&aacute;cter. Las acciones v&aacute;lidas son las
  siguientes: "N" es un movimiento hacia el norte, "S" - Sur, "W" - Oeste, "E" - Este y "." mantiene
  en la misma posici&oacute;n durante el turno. Recuerda que los tornados se mueven
  simult&aacute;neamente con el buque, por lo que deber&aacute;s planificar para no navegar
  hacia uno.
</p>

<p>
  Al iniciar tienes 100 unidades de combustible y cada movimiento utiliza una unidad
  (incluso cuando esperas). Deber&aacute;s economizar el uso de combustible, ya que los
  puntos que obtienes dependen de la cantidad de combustible que queda al terminar
  el juego. Si te quedas sin combustible, tu barco permanecer&aacute; a la deriva para
  siempre. En alg&uacute;n punto la tripulaci&oacute;n decidir&aacute; abandonarlo y esto ocasiona que
  se termine el juego.
</p>

<p style="text-align: center;">
    <img class="for_info_only" title="example" src="{{MEDIA}}example.svg" alt="example"/>
    <img class="for_editor_only" title="example" src="{{MEDIA}}example.svg" alt="example" width="380px"/>
</p>

<p>
  Para esta misi&oacute;n, podr&aacute;s continuar con el juego hasta que lo termines (es decir,
  hasta que consigas un <strong><em>game over</em></strong>). Por cada juego, recibir&aacute;s puntos equivalentes
  a la cantidad de combustible restante. Si te estrellas, recibir&aacute;s 0 puntos para
  ese juego. La puntuaci&oacute;n resultante es la suma de las puntuaciones de cada juego.
  Ten en cuenta que cada juego comienza en un nuevo entorno (<em>environment</em>).
</p>

<p>
    <strong>Datos de Entrada: </strong> Dos argumentos. Un mapa del mar como una
    tupla de cadenas (<em>str</em>), y el combustible restante como un entero (<em>int</em>).

</p>

<p>
    <strong>Salida: </strong> La acci&oacute;n a ejecutar, como una cadena (<em>str</em>).
</p>


<div class="for_info_only">
    <p>
        <strong>Ejemplo:</strong>
    </p>
    <textarea data-code="python">move_ship(("S....", ".XXX.", "..OX.", ".XXX.", "....."), 100) # "E" or "S"</textarea>
</div>
<br>
<p class="for_info_only">
    <strong>&iquest;C&oacute;mo se usa?:</strong>
    Aqu&iacute; podr&aacute;s examinar c&oacute;mo utilizar y desarrollar algoritmos de b&uacute;squeda de
    rutas que reaccionan a cambios del entorno. Estos conceptos pueden ser
    &uacute;tiles para el enrutamiento de redes con topolog&iacute;a inestable.

</p>

<p>
    <strong>Condiciones:</strong><br>
    5 &le; len(sea_map) &le; 10<br>
    all(5 &le; len(row) &le; 10 for row in sea_map)<br>

</p>
